Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courtroom/court_registrar.html.txt.tmx
Source language: en
Languages: ga

source: The Court Registrar usually sits on a slightly raised platform below the judge facing the court
ga: Bíonn Cláraitheoir na Cúirte ina shuí/ina suí go hiondúil ar ardán ardaithe beagán faoin mbreitheamh, os comhair na cúirte

source: They do not wear any special clothes in court, although sometimes in the High Court if the Registrar happens to also be a barrister, they will wear barrister's robes
ga: Ní chaitheann sé nó sí aon éadach speisialta sa chúirt, ach uaireanta san Ard Chúirt más abhcóide chomh maith an Cláraitheoir caithfidh sé nó sí róbaí abhcóide

source: Court Registrars are public servants and they are recruited directly from the civil service
ga: Seirbhísigh poiblí is ea iad Cláraitheoirí Cúirte agus earcaítear iad go díreach ón státseirbhís

source: The Registrar's main function is to assist the judge:
ga: Is í príomhfheidhm an Chláraitheora cúnamh a thabhairt don bhreitheamh:

source: • The Registrar has a list of all the cases before the court for the day
ga: • Tá liosta de cásanna go léir na cúirte don lá ag an gCláraitheoir

source: They call out each case in turn so that the parties can identify themselves to the court
ga: Fograíonn sé nó sí gach cás ionas go mbeidh na páirtithe in ann iad féin a chur in iúl don chúirt

source: • When a witness is called in a case, it is the Registrar who hands the witness the Bible and reads out the oath for the witness to repeat
ga: • Nuair a ghlaoitear finné i gcás, is é an Cláraitheoir a thugann an Bíobla don fhinné agus a léann amach an mionn a chaitheann an finné a athrá

source: • The Registrar keeps the court documents (writs, etc.) for each case and hands them to the judge as each case is called
ga: • Coinníonn an Cláraitheoir doiciméid na cúirte (eascairí, etc.) do gach cás agus tugann don bhreitheamh iad nuair a fhógraítear gach cás

source: • When the court makes an order, the Registrar keeps a note of the order
ga: • Nuair a dhéanann cúirt ordú, coinníonn an Cláraitheoir nóta den ordú

source: • After the day in court, the Registrar drafts the orders that the judge has made that day and keeps a record of those orders
ga: • Tar éis lá sa chúirt déanann an Cláraitheoir na horduithe a rinne an breitheamh an lá sin a dhréachtú agus coinníonn sé taifead de na horduithe sin

source: • The Registrar generally deals with the administration necessary for the smooth running of the courts
ga: • Pléann an Cláraitheoir leis an riarachán is gá le go mbeidh na cúirteanna in ann feidhmiú gan tuisliú
